#include "RbArmConfig.h"//'''Arm5DoF协作机械臂运动学'''

////# 关节角度下限, 单位: 弧度     -90      -151    -45     -120     -90
//float JOINT_ANGLE_LOWERB[6] = {-1.5708, -2.65, -0.7854, -2.0944, -1.5708};
////# 关节角度上限制, 单位: 弧度   +90      -13     124      120      90
//float JOINT_ANGLE_UPPERB[6] = {1.5708, -0.2269, 2.18166, 2.0944, 1.5708};

//# 关节角度下限, 单位: 弧度     -90      -180    -90     -90     -90
float JOINT_ANGLE_LOWERB[6] = {-1.5708, -3.1415, -1.5708, -1.5708, -1.5708};
//# 关节角度上限制, 单位: 弧度   +90        0     180      180      90
float JOINT_ANGLE_UPPERB[6] = {1.5708,   0.0000, 3.1415, 3.1415, 1.5708};
//	# 默认关节角度 单位: 弧度
//	# 注: 角度转弧度 
A_JointAngkeSt_ JOINT_ANGLE_DEFAULT = {0, -90.0, 90.0, 0, 0, 0};